#+TITLE:XenHunt Config (Note-Taking module)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's Note-Taking module
#+STARTUP: content
#+PROPERTY: header-args :tangle note-taking.el

** Org-Noter
:PROPERTIES:
:CUSTOM_ID: org-noter
:END:
#+begin_src emacs-lisp
(use-package org-noter
  :defer 6
  :custom
  (org-noter-auto-save-last-location t)
  (org-noter-always-create-frame nil)
  (org-noter-notes-search-path "~/.org/roam/citar-notes")
  (org-noter-notes-path (file-truename "~/.org/roam/citar-notes"))
  :init
  ;; (setq org-noter-notes-path (file-truename "~/.org/roam/citar-notes"))
  
  (add-hook 'org-noter-doc-mode-hook (lambda ()
                                       (evil-mode -1)
                                       (evil-mode +1)))
  :config
  (general-define-key
   :states 'normal
   :keymaps 'org-noter-doc-mode-map
   :prefix "SPC"
   "m" '(:ignore t :wk "Mode keybindigs")
   ;; "mn" '(:ignore t :wk "Org-Noter")
   "mN i" '(org-noter-insert-note :wk "Insert note")
   "mN q" '(org-noter-kill-session :wk "Kill session")
   "mN p" '(org-noter-insert-precise-note :wk "Insert precise note")
   "mN j" '(org-noter-sync-next-note :wk "Sync next note")
   "mN k" '(org-noter-sync-prev-note :wk "Sync prev note")
   "mN ." '(org-noter-sync-current-note :wk "Sync current note"))
  (org-noter-enable-org-roam-integration))
#+end_src

#+RESULTS:
: [nil 26953 38895 924578 nil elpaca-process-queues nil nil 533000 nil]

** Ltex-Plus
:PROPERTIES:
:CUSTOM_ID: ltex-plus
:END:
#+begin_src emacs-lisp
(use-package lsp-ltex-plus
  :init
  (lsp-ltex-plus-enable-for-modes
    :restrict-to '(org-mode markdown-mode latex-mode LaTeX-mode))
  )
#+end_src

#+RESULTS:
: [nil 27198 41165 486059 nil elpaca-process-queues nil nil 353000 nil]

